zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_GIC.h
/*
 * Copyright 2024-2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/*!
 * @file S32K566_GIC.h
 * @version 1.3
 * @date 2024-07-21
 * @brief Peripheral Access Layer for S32K566_GIC
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
* @page misra_violations MISRA-C:2012 violations
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
* The SoC header defines typedef for all modules.
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
* The SoC header defines macros for all modules and registers.
*
* @section [global]
* Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
* These are generated macros used for accessing the bit-fields from registers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.1, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.2, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.4, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.5, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
* This type qualifier is needed to ensure correct I/O access and addressing.
*/

/* Prevention from multiple including the same memory map */
#if !defined(S32K566_GIC_H_)  /* Check if memory map has not been already included */
#define S32K566_GIC_H_

#include "S32K566_COMMON.h"

/* ----------------------------------------------------------------------------
   -- S32_GIC Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup S32_GIC_Peripheral_Access_Layer S32_GIC Peripheral Access Layer
 * @{
 */

/** \brief  Structure type to access the Generic Interrupt Controller Distributor (GICD)
*/

/** S32_GICD - Size of Registers Arrays */
#define S32_GICD_IGROUPR_COUNT                      30u
#define S32_GICD_ISENABLER_COUNT                    30u
#define S32_GICD_ICENABLER_COUNT                    30u
#define S32_GICD_ISPENDR_COUNT                      30u
#define S32_GICD_ICPENDR_COUNT                      30u
#define S32_GICD_ISACTIVER_COUNT                    30u
#define S32_GICD_ICACTIVER_COUNT                    30u
#define S32_GICD_IPRIORITYR_COUNT                   240u
#define S32_GICD_ICFGR_COUNT                        60u
#define S32_GICD_IROUTER_COUNT                      960u
typedef struct
{
  __IO uint32_t GICD_CTLR;                                       /*!< \brief  Offset: 0x000 (R/W) Distributor Control Register */
  __I  uint32_t GICD_TYPRE;                                      /*!< \brief  Offset: 0x004 (RO) Interrupt Controller Type Register */
  __I  uint32_t GICD_IIDR;                                       /*!< \brief  Offset: 0x008 (RO) Distributor Implementer Identification Register */
       uint32_t RESERVED_0[30];
  __IO uint32_t GICD_IGROUPR[S32_GICD_IGROUPR_COUNT];            /*!< \brief  Offset: 0x084 (R/W) Interrupt Group Registers */
       uint32_t RESERVED_1[2];
  __IO uint32_t GICD_ISENABLER[S32_GICD_ISENABLER_COUNT];        /*!< \brief  Offset: 0x104 (R/W) Interrupt Set-Enable Registers */
       uint32_t RESERVED_2[2];
  __IO uint32_t GICD_ICENABLER[S32_GICD_ICENABLER_COUNT];        /*!< \brief  Offset: 0x184 (R/W) Interrupt Clear-Enable Registers */
       uint32_t RESERVED_3[2];
  __IO uint32_t GICD_ISPENDR[S32_GICD_ISPENDR_COUNT];            /*!< \brief  Offset: 0x204 (R/W) Interrupt Set-Pending Registers */
       uint32_t RESERVED_4[2];
  __IO uint32_t GICD_ICPENDR[S32_GICD_ICPENDR_COUNT];            /*!< \brief  Offset: 0x284 (R/W) Interrupt Clear-Pending Registers */
       uint32_t RESERVED_5[2];
  __IO uint32_t GICD_ISACTIVER[S32_GICD_ISACTIVER_COUNT];        /*!< \brief  Offset: 0x304 (R/W) Interrupt Set-Active Registers */
       uint32_t RESERVED_6[2];
  __IO uint32_t GICD_ICACTIVER[S32_GICD_ICACTIVER_COUNT];        /*!< \brief  Offset: 0x384 (R/W) Interrupt Clear-Active Registers */
       uint32_t RESERVED_7[9];
  __IO uint32_t GICD_IPRIORITYR[S32_GICD_IPRIORITYR_COUNT];      /*!< \brief  Offset: 0x420 (R/W) Interrupt Priority Registers */
       uint32_t RESERVED_8[266];
  __IO uint32_t GICD_ICFGR[S32_GICD_ICFGR_COUNT];                /*!< \brief  Offset: 0xC08 (R/W) Interrupt Configuration Registers */
       uint32_t RESERVED_9[5378];
  __IO uint64_t GICD_IROUTER[S32_GICD_IROUTER_COUNT];            /*!< \brief  Offset: 0x6100(R/W) Interrupt Routing Registers */
       uint32_t RESERVED_10[8244];
  __I  uint32_t GICD_PIDR4;                                      /*!< \brief  Offset: +0xFFD0 - RO - Identification Register */
  __I  uint32_t GICD_PIDR5;                                      /*!< \brief  Offset: +0xFFD4 - RO - Identification Register */
  __I  uint32_t GICD_PIDR6;                                      /*!< \brief  Offset: +0xFFD8 - RO - Identification Register */
  __I  uint32_t GICD_PIDR7;                                      /*!< \brief  Offset: +0xFFDC - RO - Identification Register */
  __I  uint32_t GICD_PIDR0;                                      /*!< \brief  Offset: +0xFFE0 - RO - Identification Register */
  __I  uint32_t GICD_PIDR1;                                      /*!< \brief  Offset: +0xFFE4 - RO - Identification Register */
  __I  uint32_t GICD_PIDR2;                                      /*!< \brief  Offset: +0xFFE8 - RO - Identification Register */
  __I  uint32_t GICD_PIDR3;                                      /*!< \brief  Offset: +0xFFEC - RO - Identification Register */
  __I  uint32_t GICD_CIDR0;                                      /*!< \brief  Offset: +0xFFF0 - RO - Component Identification Register */
  __I  uint32_t GICD_CIDR1;                                      /*!< \brief  Offset: +0xFFF4 - RO - Component Identification Register */
  __I  uint32_t GICD_CIDR2;                                      /*!< \brief  Offset: +0xFFF8 - RO - Component Identification Register */
  __I  uint32_t GICD_CIDR3;                                      /*!< \brief  Offset: +0xFFFC - RO - Component Identification Register */
}  S32_GICD_Type, *S32_GICDMemMapPtr;

