zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_GIC.h
/* S32_GICD - Peripheral instance base addresses */
/** Peripheral S32_GICD base address */
#define IP_S32_GICD_BASE                         (0x43000000u)
/** Peripheral S32_GICD base pointer */
#define S32_GICD                                 ((S32_GICD_Type *)IP_S32_GICD_BASE)

/** \brief  Structure type to access the Generic Interrupt Controller Redistributor (GICR)
*/

/** S32_GICR - Size of Registers Arrays */
#define S32_GICR_IPRIORITYR_COUNT                      8u

typedef struct
{
  __I  uint32_t GICR_CTLR;                                       /*!< \brief  Offset: 0x000 (RO) Redistributor Control Register */
  __I  uint32_t GICR_IIDR;                                       /*!< \brief  Offset: 0x004 (RO) Redistributor Implementer Identification Register */
  __I  uint32_t GICR_TYPER;                                      /*!< \brief  Offset: 0x008 (RO) Interrupt Controller Type Register */
       uint32_t RESERVED_0;
  __IO uint32_t GICR_WAKER;                                      /*!< \brief  Offset: 0x014 (R/W) Redistributor Wake Register */
       uint32_t RESERVED_1[26];
  __IO uint32_t GICR_IGROUPR;                                    /*!< \brief  Offset: 0x080 (R/W) Interrupt Group Registers */
       uint32_t RESERVED_2[31];
  __IO uint32_t GICR_ISENABLER;                                  /*!< \brief  Offset: 0x100 (R/W) Interrupt Set-Enable Registers */
       uint32_t RESERVED_3[31];
  __IO uint32_t GICR_ICENABLER;                                  /*!< \brief  Offset: 0x180 (R/W) Interrupt Clear-Enable Registers */
       uint32_t RESERVED_4[31];
  __IO uint32_t GICR_ISPENDR;                                    /*!< \brief  Offset: 0x200 (R/W) Interrupt Set-Pending Registers */
       uint32_t RESERVED_5[31];
  __IO uint32_t GICR_ICPENDR;                                    /*!< \brief  Offset: 0x280 (R/W) Interrupt Clear-Pending Registers */
       uint32_t RESERVED_6[31];
  __IO uint32_t GICR_ISACTIVER;                                  /*!< \brief  Offset: 0x300 (R/W) Interrupt Set-Active Registers */
       uint32_t RESERVED_7[31];
  __IO uint32_t GICR_ICACTIVER;                                  /*!< \brief  Offset: 0x380 (R/W) Interrupt Clear-Active Registers */
       uint32_t RESERVED_8[31];
  __IO uint32_t GICR_IPRIORITYR[S32_GICR_IPRIORITYR_COUNT];      /*!< \brief  Offset: 0x400 (R/W) Interrupt Priority Registers */
       uint32_t RESERVED_9[504];
  __IO uint32_t GICR_ICFGR0;                                     /*!< \brief  Offset: 0xC00 (R/W) Interrupt Configuration Registers 0 */
  __IO uint32_t GICR_ICFGR1;                                     /*!< \brief  Offset: 0xC04 (R/W) Interrupt Configuration Registers 1 */
       uint32_t RESERVED_10[15602];
  __I  uint32_t GICR_PIDR4;                                      /*!< \brief  Offset: +0xFFD0 - RO - Identification Register */
  __I  uint32_t GICR_PIDR5;                                      /*!< \brief  Offset: +0xFFD4 - RO - Identification Register */
  __I  uint32_t GICR_PIDR6;                                      /*!< \brief  Offset: +0xFFD8 - RO - Identification Register */
  __I  uint32_t GICR_PIDR7;                                      /*!< \brief  Offset: +0xFFDC - RO - Identification Register */
  __I  uint32_t GICR_PIDR0;                                      /*!< \brief  Offset: +0xFFE0 - RO - Identification Register */
  __I  uint32_t GICR_PIDR1;                                      /*!< \brief  Offset: +0xFFE4 - RO - Identification Register */
  __I  uint32_t GICR_PIDR2;                                      /*!< \brief  Offset: +0xFFE8 - RO - Identification Register */
  __I  uint32_t GICR_PIDR3;                                      /*!< \brief  Offset: +0xFFEC - RO - Identification Register */
  __I  uint32_t GICR_CIDR0;                                      /*!< \brief  Offset: +0xFFF0 - RO - Component Identification Register */
  __I  uint32_t GICR_CIDR1;                                      /*!< \brief  Offset: +0xFFF4 - RO - Component Identification Register */
  __I  uint32_t GICR_CIDR2;                                      /*!< \brief  Offset: +0xFFF8 - RO - Component Identification Register */
  __I  uint32_t GICR_CIDR3;                                      /*!< \brief  Offset: +0xFFFC - RO - Component Identification Register */
}  S32_GICR_Type, *S32_GICRMemMapPtr;

/* S32_GICR - Peripheral instance base addresses */
/** Peripheral S32_GICR base address */
#define IP_S32_GICR_BASE                         (0x430C0000u)
/** Peripheral S32_GICR base pointer */
#define S32_GICR                                 ((S32_GICR_Type *)IP_S32_GICR_BASE)

/* ----------------------------------------------------------------------------
   -- S32_GIC Register Masks
   ---------------------------------------------------------------------------- */


/*!
 * @}
 */ /* end of group S32_GIC_Register_Masks */

/*==================================================================================================
*                                             ENUMS
==================================================================================================*/
typedef enum {
    GIC500_INTG_G0,
    GIC500_INTG_G1

} GIC500_IntGroupType;

typedef enum {
    GIC500_INTS_LEVEL,
    GIC500_INTS_EDGE

} GIC500_IntSignalType;

/* Follows the MPIDR_EL1 layout of Aff1 and Aff0 */
#define GIC500_AFF_CLUSTER0_CPU0    (0x0000UL)
#define GIC500_AFF_CLUSTER0_CPU1    (0x0001UL)
#define GIC500_AFF_CLUSTER0_CPU2    (0x0002UL)
#define GIC500_AFF_CLUSTER0_CPU3    (0x0003UL)

#define GIC500_AFF_CLUSTER1_CPU0    (0x0100UL)
#define GIC500_AFF_CLUSTER1_CPU1    (0x0101UL)
#define GIC500_AFF_CLUSTER1_CPU2    (0x0102UL)
#define GIC500_AFF_CLUSTER1_CPU3    (0x0103UL)

/* Special value - Use this to route to the executing core */
#define GIC500_AFF_CURRENT_PE       (0xFF55UL)

/* Special value - Use this to route to any participating PE ("1 of N") */
#define GIC500_AFF_ANY_PE           (0xFFAAUL)

/*
* The GIC-500 only supports topologies where affinity levels 2 and above are the same. That is,
* all cores must have MPIDR values of the form 0.0.c.d, where c and d are variables. The range
* for c is assumed to start at 0 and be contiguous. The range for d is also assumed to start at 0 and
* be contiguous for each c. For example, the first processor must have IDs 0.0.0.0 to 0.0.0.x and
* the second processor must have IDs 0.0.1.0 to 0.0.1.y
*/

/* Clusters map to Aff1 */
#define GIC500_CLUSTER_COUNT               (1U)
/* Cores map to Aff0 */
#define GIC500_CPU_PER_CLUSTER_COUNT       (2U)


