zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_GIC.h
#define GIC500_PRIO_BITS_COUNT             (5U)


#define GIC500_MIN_SGI_ID                  (0U)
#define GIC500_MIN_PPI_ID                  (16U)
#define GIC500_MIN_SPI_ID                  (32U)
#define GIC500_MAX_SPI_ID                  (960U)
#define GIC500_MAX_INT_ID                  (GIC500_MAX_SPI_ID + 32U)


/* MSB = 17 + max(1, ceil(log2 (total_number_of_cpus))) */
#define GIC500_CPU_COUNT                   (GIC500_CLUSTER_COUNT * GIC500_CPU_PER_CLUSTER_COUNT)
/* Set this to 20, as stated by the R52 TRM, if the current value doesn't work */
#define GIC500_MSB                         (20U)
#define GIC500_REDIST_OFFSET               (1U << GIC500_MSB)
#define GIC500_PADDING_BYTES               (GIC500_REDIST_OFFSET - 0x40000U)


#define IP_GIC500_BASE                     (0x43000000U)
#define IP_GIC500                          ((GIC500_Type *)IP_GIC500_BASE)
#define IP_GIC500_BASE_ADDRS               { IP_GIC500_BASE }
#define IP_GIC500_BASE_PTRS                { IP_GIC500 }

#define GIC500_GICD_IROUTER_AFF2_MASK              (0x00FF0000UL)
#define GIC500_GICD_IROUTER_AFF2_SHIFT             (16UL)
#define GIC500_GICD_IROUTER_AFF2(x)                (((uint32_t)(((uint32_t)(x)) << GIC500_GICD_IROUTER_AFF2_SHIFT)) & GIC500_GICD_IROUTER_AFF2_MASK)

#define GIC500_GICD_IROUTER_AFF1_MASK              (0x0000FF00UL)
#define GIC500_GICD_IROUTER_AFF1_SHIFT             (8UL)
#define GIC500_GICD_IROUTER_AFF1(x)                (((uint32_t)(((uint32_t)(x)) << GIC500_GICD_IROUTER_AFF1_SHIFT)) & GIC500_GICD_IROUTER_AFF1_MASK)

#define GIC500_GICD_IROUTER_AFF0_MASK              (0x000000FFUL)
#define GIC500_GICD_IROUTER_AFF0_SHIFT             (0UL)
#define GIC500_GICD_IROUTER_AFF0(x)                (((uint32_t)(((uint32_t)(x)) << GIC500_GICD_IROUTER_AFF0_SHIFT)) & GIC500_GICD_IROUTER_AFF0_MASK)

#define GIC500_GICD_IROUTER_IRM_MASK               (0x80000000UL)
#define GIC500_GICD_IROUTER_IRM_SHIFT              (31UL)
#define GIC500_GICD_IROUTER_IRM(x)                 (((uint32_t)(((uint32_t)(x)) << GIC500_GICD_IROUTER_IRM_SHIFT)) & GIC500_GICD_IROUTER_IRM_MASK)
/*==================================================================================================
*                                          USER TYPES
==================================================================================================*/
struct gic500_gicd_if
{
          volatile uint32_t CTLR;               /* +0x0000 - RW - Distributor Control Register */
    const volatile uint32_t TYPER;              /* +0x0004 - RO - Interrupt Controller Type Register */
    const volatile uint32_t IIDR;               /* +0x0008 - RO - Distributor Implementer Identification Register */
    const volatile uint32_t padding0[13];       /* Reserved */
          volatile uint32_t SETSPI_NSR;         /* +0x0040 - WO - Non-Secure SPI Set Register (Used when SPI is signalled using MSI) */
    const volatile uint32_t padding1;           /* Reserved */
          volatile uint32_t CLRSPI_NSR;         /* +0x0048 - WO - Non-Secure SPI Clear Register (Used when SPI is signalled using MSI) */
    const volatile uint32_t padding2;           /* Reserved */
          volatile uint32_t SETSPI_SR;          /* +0x0050 - WO - Secure SPI Set Register (Used when SPI is signalled using MSI) */
    const volatile uint32_t padding3;           /* Reserved */
          volatile uint32_t CLRSPI_SR;          /* +0x0058 - WO - Secure SPI Clear Register (Used when SPI is signalled using MSI) */
    const volatile uint32_t padding4[9];        /* Reserved */
          volatile uint32_t IGROUPR[31];        /* +0x0080 - RW - Interrupt Group Registers */
    const volatile uint32_t padding5;           /* Reserved */
          volatile uint32_t ISENABLER[31];      /* +0x0100 - RW - Interrupt Set-Enable Registers */
    const volatile uint32_t padding6;           /* Reserved */
          volatile uint32_t ICENABLER[31];      /* +0x0180 - RW - Interrupt Clear-Enable Registers */
    const volatile uint32_t padding7;           /* Reserved */
          volatile uint32_t ISPENDR[31];        /* +0x0200 - RW - Interrupt Set-Pending Registers  */
    const volatile uint32_t padding8;           /* Reserved */
          volatile uint32_t ICPENDR[31];        /* +0x0280 - RW - Interrupt Clear-Pending Registers */
    const volatile uint32_t padding9;           /* Reserved */
          volatile uint32_t ISACTIVER[31];      /* +0x0300 - RW - Interrupt Set-Active Register */
    const volatile uint32_t padding10;          /* Reserved */
          volatile uint32_t ICACTIVER[31];      /* +0x0380 - RW - Interrupt Clear-Active Register */
    const volatile uint32_t padding11;          /* Reserved */
          volatile uint32_t IPRIORITYR[248];    /* +0x0400 - RW - Interrupt Priority Registers */
    const volatile uint32_t padding12[8];       /* Reserved */
          volatile uint32_t ITARGETSR[248];     /* +0x0800 - RW - Interrupt Processor Targets Registers */
    const volatile uint32_t padding13[8];       /* Reserved */
          volatile uint32_t ICFGR[62];          /* +0x0C00 - RW - Interrupt Configuration Registers */
    const volatile uint32_t padding14[2];       /* Reserved */
    const volatile uint32_t padding15[31];      /* Reserved */
    const volatile uint32_t padding16[33];      /* Reserved */
          volatile uint32_t NSACR[62];          /* +0x0E00 - RW - Non-Secure Access Control Registers */
    const volatile uint32_t padding17[2];       /* Reserved */
          volatile uint32_t SGIR;               /* +0x0F00 - WO - Software Generated Interrupt Register */
    const volatile uint32_t padding18[3];       /* Reserved */
          volatile uint32_t CPENDSGIR[4];       /* +0x0F10 - RW - SGI Clear-Pending Registers */
          volatile uint32_t SPENDSGIR[4];       /* +0x0F20 - RW - SGI Set-Pending Registers */
    const volatile uint32_t padding19[5236];    /* Reserved */
          volatile uint64_t IROUTER[960];       /* +0x6100 - RW - Interrupt Routing Registers (Controls SPI routing when ARE=1) */
    const volatile uint32_t padding20[4160];    /* Reserved */
    const volatile uint32_t ESTATUSR;           /* +0xC000 - RO - Extended Status Register*/
          volatile uint32_t ERRTESTR;           /* +0xC004 - WO - Error Test Register*/
    const volatile uint32_t padding21[31];      /* Reserved */
    const volatile uint32_t SPISR[30];          /* +0xC084 - RO - GIC-500 Shared Peripheral Interrupt Status Registers */
    const volatile uint32_t padding22[4021];    /* Reserved */
    const volatile uint32_t PIDR4;              /* +0xFFD0 - RO - Peripheral ID 4 Register */
    const volatile uint32_t PIDR5;              /* +0xFFD4 - RO - Peripheral ID 5 Register */
    const volatile uint32_t PIDR6;              /* +0xFFD8 - RO - Peripheral ID 6 Register */
    const volatile uint32_t PIDR7;              /* +0xFFDC - RO - Peripheral ID 7 Register */
    const volatile uint32_t PIDR0;              /* +0xFFE0 - RO - Peripheral ID 0 Register */
    const volatile uint32_t PIDR1;              /* +0xFFE4 - RO - Peripheral ID 1 Register */
    const volatile uint32_t PIDR2;              /* +0xFFE8 - RO - Peripheral ID 2 Register */
    const volatile uint32_t PIDR3;              /* +0xFFEC - RO - Peripheral ID 3 Register */
    const volatile uint32_t CIDR0;              /* +0xFFF0 - RO - Component ID 0 Register */
    const volatile uint32_t CIDR1;              /* +0xFFF4 - RO - Component ID 1 Register */
    const volatile uint32_t CIDR2;              /* +0xFFF8 - RO - Component ID 2 Register */
    const volatile uint32_t CIDR3;              /* +0xFFFC - RO - Component ID 3 Register */
};

struct gic500_gicd_mbspi_if
{
    const volatile uint32_t padding0[16];       /* Reserved */
          volatile uint32_t SETSPI_NSR;         /* +0x0040 - WO - Aliased Non-secure SPI Set Register */
    const volatile uint32_t padding1;           /* Reserved */
          volatile uint32_t CLRSPI_NSR;         /* +0x0048 - WO - Aliased Non-secure SPI Clear Register */
    const volatile uint32_t padding2;           /* Reserved */
          volatile uint32_t SETSPI_SR;          /* +0x0050 - WO - Aliased Secure SPI Set Register */
    const volatile uint32_t padding3;           /* Reserved */
          volatile uint32_t CLRSPI_SR;          /* +0x0058 - WO - Aliased Secure SPI Clear Register */
    const volatile uint32_t padding4[16361];    /* Reserved */
};

typedef struct gic500_gicr_if
{
          volatile uint32_t CTLR;               /* +0x0000 - RW - Redistributor Control Register */
    const volatile uint32_t IIDR;               /* +0x0004 - RO - Redistributor Implementer Identification Register */
    const volatile uint64_t TYPER;              /* +0x0008 - RO - Redistributor Type Register */
    const volatile uint32_t padding0;           /* Reserved */
          volatile uint32_t WAKER;              /* +0x0014 - RW - Power Management Control Register */
    const volatile uint32_t padding1[22];       /* Reserved */
          volatile uint64_t PROPBASER;          /* +0x0070 - RW - Common LPI Configuration Table Register */
          volatile uint64_t PENDBASER;          /* +0x0078 - RW - LPI Pending Table Base Register */
    const volatile uint32_t padding2[16340];    /* Reserved */
    const volatile uint32_t PIDR4;              /* +0xFFD0 - RO - Peripheral ID 4 Register */
    const volatile uint32_t PIDR5;              /* +0xFFD4 - RO - Peripheral ID 5 Register */
    const volatile uint32_t PIDR6;              /* +0xFFD8 - RO - Peripheral ID 6 Register */
    const volatile uint32_t PIDR7;              /* +0xFFDC - RO - Peripheral ID 7 Register */
    const volatile uint32_t PIDR0;              /* +0xFFE0 - RO - Peripheral ID 0 Register */
    const volatile uint32_t PIDR1;              /* +0xFFE4 - RO - Peripheral ID 1 Register */
    const volatile uint32_t PIDR2;              /* +0xFFE8 - RO - Peripheral ID 2 Register */
    const volatile uint32_t PIDR3;              /* +0xFFEC - RO - Peripheral ID 3 Register */
    const volatile uint32_t CIDR0;              /* +0xFFF0 - RO - Component ID 0 Register */
    const volatile uint32_t CIDR1;              /* +0xFFF4 - RO - Component ID 1 Register */
    const volatile uint32_t CIDR2;              /* +0xFFF8 - RO - Component ID 2 Register */
    const volatile uint32_t CIDR3;              /* +0xFFFC - RO - Component ID 3 Register */
}gic500_gicr_if;

