zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_GIC.h
struct gic500_gicr_sgii_if
{
    const volatile uint32_t padding0[32];       /* Reserved */
          volatile uint32_t IGROUPR0;           /* +0x0080 - RW - Interrupt Group Registers */
    const volatile uint32_t padding1[31];       /* Reserved */
          volatile uint32_t ISENABLER0;         /* +0x0100 - RW - Interrupt Set-Enable Registers */
    const volatile uint32_t padding2[31];       /* Reserved */
          volatile uint32_t ICENABLER0;         /* +0x0180 - RW - Interrupt Clear-Enable Registers */
    const volatile uint32_t padding3[31];       /* Reserved */
          volatile uint32_t ISPENDR0;           /* +0x0200 - RW - Interrupt Set-Pending Registers */
    const volatile uint32_t padding4[31];       /* Reserved */
          volatile uint32_t ICPENDR0;           /* +0x0280 - RW - Interrupt Clear-Pending Registers */
    const volatile uint32_t padding5[31];       /* Reserved */
          volatile uint32_t ISACTIVER0;         /* +0x0300 - RW - Interrupt Set-Active Register */
    const volatile uint32_t padding6[31];       /* Reserved */
          volatile uint32_t ICACTIVER0;         /* +0x0380 - RW - Interrupt Clear-Active Register */
    const volatile uint32_t padding7[31];       /* Reserved */
          volatile uint32_t IPRIORITYR[8];      /* +0x0400 - RW - Interrupt Priority Registers */
    const volatile uint32_t padding8[504];      /* Reserved */
          volatile uint32_t ICFGR[2];           /* +0x0C00 - RW - Interrupt Configuration Registers */
    const volatile uint32_t padding9[62];       /* Reserved */
    const volatile uint32_t padding10;          /* Reserved */
    const volatile uint32_t padding11[63];      /* Reserved */
          volatile uint32_t NSACR;              /* +0x0E00 - RW - Non-Secure Access Control Register */
    const volatile uint32_t padding12[11391];   /* Reserved */
    const volatile uint32_t MISCSTATUSR;        /* +0xC000 - RO - Miscellaneous Status Register */
    const volatile uint32_t padding13[31];      /* Reserved */
    const volatile uint32_t PPISR;              /* +0xC080 - RO - Private Peripheral Interrupt Status Register */
    const volatile uint32_t padding14[4063];    /* Reserved */
};


struct gic500_gits_if
{
          volatile uint32_t CTLR;               /* +0x0000 - RW - ITS Control Register */
    const volatile uint32_t IIDR;               /* +0x0004 - RO - Implementer Identification Register */
    const volatile uint64_t TYPER;              /* +0x0008 - RO - ITS Type Register */
    const volatile uint32_t padding0[28];       /* Reserved */
          volatile uint64_t CBASER;             /* +0x0080 - RW - Command Queue Control Register */
          volatile uint64_t CWRITER;            /* +0x0088 - RW - Command Queue Write Pointer Register */
    const volatile uint64_t CREADR;             /* +0x0090 - RO - Command Queue Read Pointer Register */
    const volatile uint32_t padding1[26];       /* Reserved */
    const volatile uint64_t BASER;              /* +0x0100 - RW - ITS Table Control Register */
    const volatile uint32_t padding2[12222];    /* Reserved */
          volatile uint32_t TRKCTLR;            /* +0x0C00 - WO - Tracking Control Register */
    const volatile uint32_t TRKR;               /* +0x0C04 - RO - Tracking Status Register */
    const volatile uint32_t TRKDIDR;            /* +0x0C08 - RO - Debug Tracked DID Register */
    const volatile uint32_t TRKPIDR;            /* +0x0C0C - RO - Debug Tracked PID Register */
    const volatile uint32_t TRKVIDR;            /* +0x0C10 - RO - Debug Tracked VID Register */
    const volatile uint32_t TRKTGTR;            /* +0x0C14 - RO - Debug Tracked Target Register */
    const volatile uint32_t TRKICR;             /* +0x0C18 - RO - Debug ITE Cache Statistics Register */
    const volatile uint32_t TRKLCR;             /* +0x0C1C - RO - Debug LPI Cache Statistics Register */
    const volatile uint32_t padding3[4076];     /* Reserved */
    const volatile uint32_t PIDR4;              /* +0xFFD0 - RO - Peripheral ID 4 Register */
    const volatile uint32_t PIDR5;              /* +0xFFD4 - RO - Peripheral ID 5 Register */
    const volatile uint32_t PIDR6;              /* +0xFFD8 - RO - Peripheral ID 6 Register */
    const volatile uint32_t PIDR7;              /* +0xFFDC - RO - Peripheral ID 7 Register */
    const volatile uint32_t PIDR0;              /* +0xFFE0 - RO - Peripheral ID 0 Register */
    const volatile uint32_t PIDR1;              /* +0xFFE4 - RO - Peripheral ID 1 Register */
    const volatile uint32_t PIDR2;              /* +0xFFE8 - RO - Peripheral ID 2 Register */
    const volatile uint32_t PIDR3;              /* +0xFFEC - RO - Peripheral ID 3 Register */
    const volatile uint32_t CIDR0;              /* +0xFFF0 - RO - Component ID 0 Register */
    const volatile uint32_t CIDR1;              /* +0xFFF4 - RO - Component ID 1 Register */
    const volatile uint32_t CIDR2;              /* +0xFFF8 - RO - Component ID 2 Register */
    const volatile uint32_t CIDR3;              /* +0xFFFC - RO - Component ID 3 Register */
};


struct gic500_gits_tln_if
{
    const volatile uint32_t padding0[16];       /* Reserved */
          volatile uint32_t TRANSLATER;         /* +0x0040 - WO - ITS Translation Register */
    const volatile uint32_t padding3[16367];    /* Reserved */
};


typedef struct {
    struct gic500_gicd_if        GICD;
    struct gic500_gicd_mbspi_if  GICD_MBSPI;
    struct gic500_gits_if        GITS;
    struct gic500_gits_tln_if    GITS_TLN;

#if (GIC500_PADDING_BYTES > 0)
    const volatile uint8_t padding0[GIC500_PADDING_BYTES];
#endif

    struct wrapper0 {
        struct gic500_gicr_if      GICR;
        struct gic500_gicr_sgii_if GICR_SGII;
    } CPU[GIC500_CPU_COUNT];

} GIC500_Type;



#endif  /* #if !defined(S32K566_GIC_H_) */
